{
  "personal": {
    "name": "PHAL SELA",
    "title": ["UX UI DESIGNER"],
    "profileImage": "/sela/my-photo/profile.png",
    "profileImage1": "/sela/my-photo/me.jpg",
    "description": "Discover my diverse portfolio showcasing polished digital solutions crafted for clients across various industries.",
    "aboutMe": "My passion lies in the intersection of art and technology, creating visually captivating interfaces and elevating overall user digital experiences.",
    "education": [
      {
        "title": "Professional UX UI Design",
        "period": "2023 - 2024",
        "description": "Graduated and get professional certificate of UX UI Design at Future.bit Academy."
      },
      {
        "title": "Management",
        "period": "2019 - 2023",
        "description": "Bachelor's degree of Management at National University of Management"
      },
      {
        "title": "High School",
        "period": "2016 - 2019",
        "description": "Graduated from High School at Royal Crusade High School"
      }
    ],
    "stats": {
      "experience": "2",
      "projects": "5+"
    },
    "socialLinks": {
      "linkedin": "https://www.linkedin.com/in/phal-sela-20856028b/",
      "telegram": "https://web.telegram.org/k/",
      "facebook": "https://www.facebook.com/cycycycysela",
      "behance": "https://www.behance.net/sila8"
    }
  },
  "projects": [
    {
      "id": 1,
      "title": "SPIK - School Management",
      "slug": "spik-school-management",
      "category": "Dashboard",
      "image": "/sela/spik/thumbnail.png",
      "fullDescription": "School Management Dashboard offers a centralized and intuitive platform designed to streamline operations for schools of all sizes. Through this platform, admins can manage student data, monitor attendance, organize class schedules, and oversee staff activities with ease. Teachers are empowered to track student performance, assign grades, and communicate effectively with students and parents, while students can access learning materials, view timetables, and stay updated on academic progress. With a clean interface and role-based access (Admin, Teacher, Student), the system ensures a smooth, secure, and efficient educational experience for all users.\n\n I applied a user-centered design approach to develop a school management dashboard tailored for administrators, teachers, and students. This involved understanding academic workflows and system requirements, then utilizing UX tools such as user flows, wireframes, interactive prototypes, and mockups to transform those requirements into intuitive, role-based user experiences.",
      "role": "UI/UX Designer",
      "technologies": ["Dashboard"],
      "logo": "/sela/spik.png",
      "images": [
        "/sela/spik/1.png",
        "/sela/spik/2.png",
        "/sela/spik/3.png"
      ],
      "link": "#"
    },
    {
      "id": 2,
      "title": "Redesign BROWN Mobile App",
      "slug": "redesign-brown-mobile-app",
      "category": "Mobile App",
      "image": "/sela/brown/thumbnail.png",
      "fullDescription": "The Brown Coffee mobile app was thoughtfully redesigned to elevate user engagement, simplify the rewards experience, and create a smoother ordering journey tailored for coffee enthusiasts in Cambodia. The redesign focused on delivering a modern, mobile-first interface that reflects the brand’s premium lifestyle while addressing usability issues and aligning with user behaviors. Key improvements centered around intuitive navigation, personalized interactions, and clear user flows—making it easier for customers to explore the menu, earn and redeem rewards, and place orders with confidence.\n\nI collaborated closely with developers during the Brown Coffee mobile app redesign to bring every interaction to life through smooth, intuitive animations. Beyond UX/UI design, I focused on ensuring each animation aligned with my Figma prototypes, maintaining consistency across the user journey. I paid close attention to motion details—such as transitions, micro-interactions, and feedback states—to enhance both usability and the overall aesthetic of the app.",
      "role": "Project Lead | UI/UX Designer",
      "technologies": ["Mobile App"],
      "screens": "50+",
      "logo": "/sela/brown.png",
      "images": [
        "/sela/brown/1.png",
        "/sela/brown/2.png",
        "/sela/brown/3.png"
      ],
      "link": "#"
    },
    {
      "id": 3,
      "title": "Bassline Music Mobile App",
      "slug": "bassline-music-app",
      "category": "Mobile App",
      "image": "/sela/bassline/thumbnail.png",
      "description": "",
      "fullDescription": "Bassline is a mobile music application inspired by the vibrant and rebellious spirit of hip-hop culture. The project was designed to deliver a raw, immersive, and personalized experience for users who live and breathe hip-hop—blending urban aesthetics, audio storytelling, and community features into one cohesive platform. The goal was to create a user experience that resonates with the authentic vibe of street culture, while providing a smooth and modern interface for discovering, streaming, and interacting with hip-hop music and artists.\n\n I was responsible for the overall UX/UI design of the Bassline Music App, which reflects hip-hop culture. Beyond layout and visuals, I worked directly with developers to bring my designs to life through interactive animations. My goal was to make the app feel alive, urban, and responsive—keeping the energy of hip-hop while improving the user experience.",
      "role": "Lead | UI/UX Designer",
      "technologies": ["Mobile App"],
      "screens": "50+",
      "logo": "/sela/bass.png",
      "images": [
        "/sela/bassline/1.png",
        "/sela/bassline/2.png",
        "/sela/bassline/3.png"
      ],
      "link": "#"
    },
    {
      "id": 4,
      "title": "RESTIN Hotel Booking",
      "slug": "rentkh-car-rent",
      "category": "Mobile App",
      "image": "/sela/restin/thumbnail.png",
      "fullDescription": "RESTIN is a hotel booking app designed to offer travelers a seamless and user-friendly way to discover, compare, and reserve accommodations. The project focuses on simplifying the booking process while delivering a polished, modern UI tailored for both local and international users.\n\n My role included designing the full UX/UI flow—from wireframes to high-fidelity prototypes—ensuring an intuitive user experience across all pages. I implemented a mobile-first approach with key features such as personalized hotel recommendations, smart filters, booking calendar, secure payment interface, and a clean booking confirmation screen. The app is crafted to build user trust, improve booking speed, and make travel planning feel effortless.",
      "role": "UI/UX Designer",
      "technologies": ["Mobile App"],
      "screens": "50+",
      "logo": "/sela/restin.png",
      "images": [
        "/sela/restin/1.png",
        "/sela/restin/2.png",
        "/sela/restin/3.png"
      ],
      "link": "#"
    },
    {
      "id": 5,
      "title": "RENTKH Car Rent",
      "slug": "rentkh-car-rent",
      "category": "Web Design",
      "image": "/sela/restin/thumbnail.png",
      "fullDescription": "RESTIN is a hotel booking app designed to offer travelers a seamless and user-friendly way to discover, compare, and reserve accommodations. The project focuses on simplifying the booking process while delivering a polished, modern UI tailored for both local and international users.\n\n My role included designing the full UX/UI flow—from wireframes to high-fidelity prototypes—ensuring an intuitive user experience across all pages. I implemented a mobile-first approach with key features such as personalized hotel recommendations, smart filters, booking calendar, secure payment interface, and a clean booking confirmation screen. The app is crafted to build user trust, improve booking speed, and make travel planning feel effortless.",
      "role": "UI/UX Designer",
      "technologies": ["Web Design"],
      "screens": "50+",
      "images": [
        "/sela/restin/1.png",
        "/sela/restin/2.png",
        "/sela/restin/3.png"
      ],
      "link": "#"
    }
  ],
  "skills": {
    "UX": [
      "User Research",
      "Prototyping", 
      "Interaction Design",
      "UX Strategy",
      "Wireframing",
      "User Stories"
    ],
    "UI": [
      "Design Systems",
      "Layout & Structure",
      "Color Theory", 
      "Typography",
      "Iconography",
      "Mockups"
    ]
  }
}